tutorials/cylinderFlap_FSI3_manifoldMapping/fluid-level-1/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object controlDict;
}

application fsiFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 0.001;

deltaT 0.001;

writeControl runTime;

writeInterval 0.001;

purgeWrite 2;

writeFormat ascii;

writePrecision 8;

writeCompression uncompressed;

timeFormat general;

timePrecision 6;

runTimeModifiable no;
adjustTimeStep no;
maxCo 0.2;

libs
  (
    "libforces.so"
  );

functions
{
  fluid-level-0
  {
    type forces;
    functionObjectLibs
      (
        "libforces.so"
      );
    outputControl timeStep;
    outputInterval 1;
    patches
      (
        plate
        cylinder
      );
    pName p;
    UName U;
    rhoName rhoInf;
    log yes;
    rhoInf 1000;
    CofR (0 0 0);
    region fluid-level-0;
  }
  fluid-level-1
  {
    type forces;
    functionObjectLibs
      (
        "libforces.so"
      );
    outputControl timeStep;
    outputInterval 1;
    patches
      (
        plate
        cylinder
      );
    pName p;
    UName U;
    rhoName rhoInf;
    log yes;
    rhoInf 1000;
    CofR (0 0 0);
    region fluid-level-1;
  }
}

